src/data_analysis/collected_data/watermelon/api/standardb16ms/b/load.txt
Running 30m test @ http://13.87.67.47:60
  2 threads and 1000 connections
  Thread calibration: mean lat.: 9.463ms, rate sampling interval: 33ms
  Thread calibration: mean lat.: 9.669ms, rate sampling interval: 33ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.96s     2.78s   12.12s    73.97%
    Req/Sec     1.00k   315.84     1.85k    84.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.42s 
 75.000%    4.30s 
 90.000%    6.30s 
 99.000%   12.12s 
 99.900%   23.51s 
 99.990%   29.84s 
 99.999%   33.21s 
100.000%   39.19s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.243     0.000000            1         1.00
      25.567     0.100000       353428         1.11
     596.991     0.200000       707047         1.25
    1191.935     0.300000      1060825         1.43
    1795.071     0.400000      1413936         1.67
    2420.735     0.500000      1767634         2.00
    2748.415     0.550000      1944539         2.22
    3094.527     0.600000      2121583         2.50
    3459.071     0.650000      2297356         2.86
    3858.431     0.700000      2474292         3.33
    4304.895     0.750000      2650879         4.00
    4554.751     0.775000      2739991         4.44
    4825.087     0.800000      2828594         5.00
    5119.999     0.825000      2916095         5.71
    5455.871     0.850000      3004763         6.67
    5840.895     0.875000      3093245         8.00
    6057.983     0.887500      3137271         8.89
    6299.647     0.900000      3181411        10.00
    6569.983     0.912500      3225206        11.43
    6881.279     0.925000      3269297        13.33
    7254.015     0.937500      3313453        16.00
    7471.103     0.943750      3335632        17.78
    7712.767     0.950000      3357728        20.00
    7991.295     0.956250      3379798        22.86
    8314.879     0.962500      3401778        26.67
    8716.287     0.968750      3423923        32.00
    8962.047     0.971875      3435113        35.56
    9240.575     0.975000      3446093        40.00
    9576.447     0.978125      3457138        45.71
    9986.047     0.981250      3468192        53.33
   10502.143     0.984375      3479072        64.00
   10838.015     0.985938      3484621        71.11
   11239.423     0.987500      3490157        80.00
   11747.327     0.989062      3495645        91.43
   12419.071     0.990625      3501172       106.67
   13328.383     0.992188      3506668       128.00
   13901.823     0.992969      3509420       142.22
   14573.567     0.993750      3512182       160.00
   15384.575     0.994531      3514956       182.86
   16302.079     0.995313      3517715       213.33
   17301.503     0.996094      3520492       256.00
   17842.175     0.996484      3521843       284.44
   18448.383     0.996875      3523253       320.00
   19152.895     0.997266      3524618       365.71
   19922.943     0.997656      3525995       426.67
   20742.143     0.998047      3527365       512.00
   21299.199     0.998242      3528064       568.89
   21807.103     0.998437      3528761       640.00
   22364.159     0.998633      3529448       731.43
   22921.215     0.998828      3530135       853.33
   23609.343     0.999023      3530827      1024.00
   23937.023     0.999121      3531163      1137.78
   24346.623     0.999219      3531510      1280.00
   24821.759     0.999316      3531859      1462.86
   25362.431     0.999414      3532197      1706.67
   25870.335     0.999512      3532540      2048.00
   26181.631     0.999561      3532716      2275.56
   26476.543     0.999609      3532890      2560.00
   26853.375     0.999658      3533070      2925.71
   27213.823     0.999707      3533231      3413.33
   27770.879     0.999756      3533407      4096.00
   28065.791     0.999780      3533490      4551.11
   28377.087     0.999805      3533576      5120.00
   28688.383     0.999829      3533662      5851.43
   29032.447     0.999854      3533748      6826.67
   29409.279     0.999878      3533836      8192.00
   29655.039     0.999890      3533878      9102.22
   29851.647     0.999902      3533923     10240.00
   30097.407     0.999915      3533963     11702.86
   30359.551     0.999927      3534007     13653.33
   30621.695     0.999939      3534050     16384.00
   30883.839     0.999945      3534071     18204.44
   31047.679     0.999951      3534093     20480.00
   31358.975     0.999957      3534115     23405.71
   31506.431     0.999963      3534136     27306.67
   31719.423     0.999969      3534158     32768.00
   31801.343     0.999973      3534168     36408.89
   32063.487     0.999976      3534179     40960.00
   32276.479     0.999979      3534190     46811.43
   32423.935     0.999982      3534201     54613.33
   32718.847     0.999985      3534212     65536.00
   32817.151     0.999986      3534217     72817.78
   32964.607     0.999988      3534223     81920.00
   33193.983     0.999989      3534229     93622.86
   33357.823     0.999991      3534233    109226.67
   33783.807     0.999992      3534239    131072.00
   34340.863     0.999993      3534241    145635.56
   34799.615     0.999994      3534244    163840.00
   35520.511     0.999995      3534247    187245.71
   35815.423     0.999995      3534249    218453.33
   36044.799     0.999996      3534252    262144.00
   36077.567     0.999997      3534253    291271.11
   36143.103     0.999997      3534255    327680.00
   36470.783     0.999997      3534256    374491.43
   36536.319     0.999998      3534257    436906.67
   37715.967     0.999998      3534259    524288.00
   37715.967     0.999998      3534259    582542.22
   37978.111     0.999998      3534260    655360.00
   38043.647     0.999999      3534261    748982.86
   38043.647     0.999999      3534261    873813.33
   38371.327     0.999999      3534262   1048576.00
   38371.327     0.999999      3534262   1165084.44
   38469.631     0.999999      3534263   1310720.00
   38469.631     0.999999      3534263   1497965.71
   38469.631     0.999999      3534263   1747626.67
   39026.687     1.000000      3534264   2097152.00
   39026.687     1.000000      3534264   2330168.89
   39026.687     1.000000      3534264   2621440.00
   39026.687     1.000000      3534264   2995931.43
   39026.687     1.000000      3534264   3495253.33
   39190.527     1.000000      3534265   4194304.00
   39190.527     1.000000      3534265          inf
#[Mean    =     2963.038, StdDeviation   =     2779.499]
#[Max     =    39157.760, Total count    =      3534265]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3553067 requests in 30.00m, 1.62GB read
  Socket errors: connect 0, read 2324, write 9566, timeout 16270
  Non-2xx or 3xx responses: 3
Requests/sec:   1973.89
Transfer/sec:      0.92MB